pages/schedule/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Schedule | Programming for Economists</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://janboone.github.io/programming_for_economists/pages/pages/schedule/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Jan Boone and Misja Mikkers">
<meta property="og:site_name" content="Programming for Economists">
<meta property="og:title" content="Schedule">
<meta property="og:url" content="https://janboone.github.io/programming_for_economists/pages/pages/schedule/">
<meta property="og:description" content='First lecture


Introduction Lecture





Before the first lecture


go to the russet server and log in
create a new notebook by clicking on "New" in the (almost) top right corner
choose "Python 3"
In'>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-11-26T17:44:50+01:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://janboone.github.io/programming_for_economists/pages/">

            <span id="blog-title">Programming for Economists</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../" class="nav-link">Webpage</a>
                </li>
<li class="nav-item">
<a href="../schedule" class="nav-link">Schedule</a>
                </li>
<li class="nav-item">
<a href="../exam" class="nav-link">Exam</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Schedule</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org1dc5637" class="outline-2">
<h2 id="org1dc5637">First lecture</h2>
<div class="outline-text-2" id="text-org1dc5637">
<p>
<a href="../../Introduction_Lecture.html">Introduction Lecture</a>
</p>
</div>
</div>

<div id="outline-container-org83effe9" class="outline-2">
<h2 id="org83effe9">Before the first lecture</h2>
<div class="outline-text-2" id="text-org83effe9">
<ul class="org-ul">
<li>go to the <a href="https://russet.uvt.nl/hub/home">russet server</a> and log in</li>
<li>create a new notebook by clicking on "New" in the (almost) top right corner</li>
<li>choose "Python 3"</li>
<li>In the first cell of this notebook, copy-paste the following code:</li>
</ul>
<p>
<code>%%bash</code>
</p>

<p>
<code>git clone https://gitlab.uvt.nl/janboone/release.git</code>
</p>

<ul class="org-ul">
<li>and press the keys "SHIFT" and "ENTER" at the same time ("ENTER" is sometimes called "RETURN")</li>
<li>the text appears "Cloning into 'release'…"</li>
<li>this adds a new folder called "release"; to see this go to "File" -&gt; "Close and Halt"</li>
<li>if you click on the folder "release", you see that there are three sub-folders called "week1", "week2", "week3"</li>
<li>each folder has two notebooks, one called "assignment" the other "class"</li>
<li>the assignment notebook you make before class and we go (quickly) over it in class</li>
<li>the class notebook we do together in class and there will be plenty of time for you to answer questions.</li>
</ul>
</div>
</div>


<div id="outline-container-org6fe41ce" class="outline-2">
<h2 id="org6fe41ce">Schedule</h2>
<div class="outline-text-2" id="text-org6fe41ce">
<p>
The schedule for the course is as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">week</th>
<th scope="col" class="org-left">Datacamp</th>
<th scope="col" class="org-left">preparation</th>
<th scope="col" class="org-left">in class</th>
</tr></thead>
<tbody><tr>
<td class="org-left"> </td>
<td class="org-left"><b>python</b></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr></tbody>
<tbody>
<tr>
<td class="org-left">30/1</td>
<td class="org-left"><a href="https://www.datacamp.com/courses/intro-to-python-for-data-science">Intro to python</a></td>
<td class="org-left">bring your laptop to the lecture</td>
<td class="org-left"><a href="../../Introduction_Lecture.html">Introduction Lecture</a></td>
</tr>
<tr>
<td class="org-left">4/2</td>
<td class="org-left"> </td>
<td class="org-left">assignment1.ipynb</td>
<td class="org-left">class1.ipynb</td>
</tr>
<tr>
<td class="org-left">11/2</td>
<td class="org-left"><a href="https://www.datacamp.com/courses/intermediate-python-for-data-science">Intermediate python</a></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left">18/2</td>
<td class="org-left"> </td>
<td class="org-left">assignment2.ipynb</td>
<td class="org-left">class2.ipynb</td>
</tr>
<tr>
<td class="org-left">25/2</td>
<td class="org-left"><a href="https://www.datacamp.com/courses/pandas-foundations">Pandas foundations</a></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left">11/3</td>
<td class="org-left"> </td>
<td class="org-left">assignment3.ipynb</td>
<td class="org-left">class3.ipynb</td>
</tr>
</tbody>
<tbody><tr>
<td class="org-left">27/3</td>
<td class="org-left"><b>midterm python</b></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr></tbody>
<tbody><tr>
<td class="org-left"> </td>
<td class="org-left"><b>R</b></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr></tbody>
<tbody>
<tr>
<td class="org-left">1/4</td>
<td class="org-left"><a href="https://www.datacamp.com/courses/free-introduction-to-r">Intro to R</a></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left">8/4</td>
<td class="org-left"> </td>
<td class="org-left">assignment4.ipynb</td>
<td class="org-left">class4a.ipynb and class4b.ipynb</td>
</tr>
<tr>
<td class="org-left">15/4</td>
<td class="org-left"><a href="https://www.datacamp.com/courses/introduction-to-the-tidyverse">Intro to tidyverse</a></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left">22/4</td>
<td class="org-left"> </td>
<td class="org-left">assignment5.ipynb</td>
<td class="org-left">class5a.ipynb and class5b.ipynb</td>
</tr>
<tr>
<td class="org-left">6/5</td>
<td class="org-left"> </td>
<td class="org-left">assignment6.ipynb</td>
<td class="org-left">class6a.ipynb and class6b.ipynb</td>
</tr>
<tr>
<td class="org-left">20/5</td>
<td class="org-left">reserve</td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
</tbody>
<tbody><tr>
<td class="org-left">5/6</td>
<td class="org-left"><b>exam R</b></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr></tbody>
<tbody><tr>
<td class="org-left">5/7</td>
<td class="org-left"><b>resit python and R</b></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr></tbody>
</table>
<p>
<b><b>Note</b></b> that the exam dates are the ones that are currently planned; but they may change. Also at this moment the exam times are not known.
</p>

<p>
For the first lecture it is useful to bring your laptop if you have one. We will show you how to start the server and evaluate python in a jupyter notebook. 
</p>

<p>
Also in the week of the first lecture, do the Datacamp course with the introduction to python (see link above).
</p>

<p>
After the lecture, we have alternating weeks of classes and Datacamp. Before you come to class, you do the assignment notebook at home. In class we will do the class notebook together. The idea of this is that you can practice python while we are around to quickly answer your questions, help you with errors etc.
</p>

<p>
Make sure that you have your notebooks complete before the exam. We will not publish solutions to the notebooks. But if you have your completed notebooks on the russet server, you are allowed to use copy/paste at the exam.
</p>

<p>
In the week without a class, you do the Datacamp lecture at home. With Datacamp you learn the python syntax (what code to type). In class we teach you how to use python to solve economic problems.
</p>
</div>
</div>

<div id="outline-container-orgbc3abd3" class="outline-2">
<h2 id="orgbc3abd3">Teaching philosophy</h2>
<div class="outline-text-2" id="text-orgbc3abd3">
<p>
We teach python/R in a way that may seem counter-intuitive to you at first sight. Our starting point is that you are not doing an engineering/IT degree; you are an economist. Hence, we are interested in economic applications; not so much in the details of the python/R language. 
</p>

<p>
Of course, you need to learn the basics of the language, things like data-types, control structures etc. In other words, you need to know what a list is, a dictionary, a numpy array, a pandas dataframe, how to define functions, use list comprehension, if-then-else structures etc. 
</p>

<p>
This "technical" part you mainly learn via Datacamp. There they teach you the details of the language such that you get the syntax right. By doing their exercises you learn to type python, recognize error messages (when you make mistakes).
</p>

<p>
In class we then focus on applying these tools to economic problems. In class we also type python and we also make mistakes which generate errors. So there is an overlap with the Datacamp lectures, but the focus in class is different. Further, in economics we are interested in optimization (we tend to maximize profits, utility etc.) and solving equations (specifically, solving for fixed points which give us equilibria). For this we use numpy and scipy, which is not covered much at the Datacamp courses that we do.
</p>

<p>
Many concepts you will first see at Datacamp and then we apply them in class. Sometimes it will be the other way around: we used something in class and you learn more details about it at Datacamp. This is perfectly fine. However, it is important that you keep up-to-date with Datacamp otherwise you are going to get lost. Also programming is something that you need to practice. You can do the same the Datacamp two or three times. Also the notebooks that we do in class, you can play around with these. Plot different functions, solve equations for different parameter values etc. Just looking at the answers that we give you in class will not help you to learn to use python/R.
</p>

<p>
Finally, we urge you to use google (or other search engines like <a href="https://duckduckgo.com/">DuckDuckGo</a>) and <a href="https://stackoverflow.com/">stackoverflow</a> with your assignments. Some students find this weird at the beginning: should we not teach you everything that you need to know? The answer is no for a number of reasons. First, even professional programmers use google and stackoverflow all the time. If you are on <a href="https://www.quora.com/">Quora</a>; see <a href="https://www.quora.com/Does-it-make-a-programmer-weak-for-using-Google-or-Stack-Overflow-when-coding">this post</a> and <a href="https://www.quora.com/Do-programmers-know-programming-from-their-hearts-or-does-Google-remain-a-useful-tool">this one</a>. Second, python and R are open source and lots of people work with it. If you encounter a problem, chances are that someone else had the same problem and knows the solution to it. There is not need to "invent the wheel". Use the resources available to you. If you copy a lot of code, you should add a reference. Finally, because python and R are open source, they develop rapidly. The things that we teach you now, will be obsolete in a couple of years time. Hence, you need to be able to find your way around also in 10 years time. To start practicing this, use google now.
</p>

<p>
The only warning here is: at the exam you will not have access to the whole internet. So, also make sure that you can find help in the jupyter notebook. We will practice this in class.
</p>
</div>
</div>
    </div>
    

</article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:j.boone@uvt.nl">Jan Boone and Misja Mikkers</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
